; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)          
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l24_p24_c24_g24_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate food crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(content-crate medicine crate24)
	(person-at person1 loc12)
	(person-at person2 loc5)
	(person-at person3 loc20)
	(person-at person4 loc17)
	(person-at person5 loc10)
	(person-at person6 loc11)
	(person-at person7 loc19)
	(person-at person8 loc3)
	(person-at person9 loc21)
	(person-at person10 loc17)
	(person-at person11 loc22)
	(person-at person12 loc17)
	(person-at person13 loc2)
	(person-at person14 loc4)
	(person-at person15 loc19)
	(person-at person16 loc24)
	(person-at person17 loc7)
	(person-at person18 loc8)
	(person-at person19 loc23)
	(person-at person20 loc10)
	(person-at person21 loc12)
	(person-at person22 loc7)
	(person-at person23 loc20)
	(person-at person24 loc20)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person6 food)
	(has-content-person person6 medicine)
	(has-content-person person7 medicine)
	(has-content-person person8 food)
	(has-content-person person8 medicine)
	(has-content-person person9 food)
	(has-content-person person10 food)
	(has-content-person person11 medicine)
	(has-content-person person12 food)
	(has-content-person person14 food)
	(has-content-person person14 medicine)
	(has-content-person person17 food)
	(has-content-person person18 food)
	(has-content-person person19 food)
	(has-content-person person20 food)
	(has-content-person person20 medicine)
	(has-content-person person21 food)
	(has-content-person person22 food)
	(has-content-person person23 food)
	(has-content-person person24 food)
))
)

; plan
1. (pick-up-crate crate24 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate24 depot)
   added: (has-crate-drone-arm drone1 right crate24)
   goals met: 1 of 25
2. (pick-up-crate crate17 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate17 depot)
   added: (has-crate-drone-arm drone1 left crate17)
   goals met: 1 of 25
3. (drone-move depot loc23 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc23)
   goals met: 0 of 25
4. (drop-crate loc23 person19 crate17 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate17)
   added: (has-content-person person19 food) (empty-arm drone1 left)
   goals met: 1 of 25
5. (drone-move loc23 depot drone1)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 depot)
   goals met: 2 of 25
6. (pick-up-crate crate16 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate16 depot)
   added: (has-crate-drone-arm drone1 left crate16)
   goals met: 2 of 25
7. (drone-move depot loc22 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc22)
   goals met: 1 of 25
8. (drop-crate loc22 person11 crate24 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate24)
   added: (has-content-person person11 medicine) (empty-arm drone1 right)
   goals met: 2 of 25
9. (drone-move loc22 depot drone1)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 depot)
   goals met: 3 of 25
10. (pick-up-crate crate23 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate23 depot)
   added: (has-crate-drone-arm drone1 right crate23)
   goals met: 3 of 25
11. (drone-move depot loc21 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc21)
   goals met: 2 of 25
12. (drop-crate loc21 person9 crate16 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate16)
   added: (has-content-person person9 food) (empty-arm drone1 left)
   goals met: 3 of 25
13. (drone-move loc21 depot drone1)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 depot)
   goals met: 4 of 25
14. (pick-up-crate crate15 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate15 depot)
   added: (has-crate-drone-arm drone1 left crate15)
   goals met: 4 of 25
15. (drone-move depot loc19 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc19)
   goals met: 3 of 25
16. (drop-crate loc19 person7 crate23 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate23)
   added: (has-content-person person7 medicine) (empty-arm drone1 right)
   goals met: 4 of 25
17. (drone-move loc19 depot drone1)
   deleted: (drone-at drone1 loc19)
   added: (drone-at drone1 depot)
   goals met: 5 of 25
18. (pick-up-crate crate22 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate22 depot)
   added: (has-crate-drone-arm drone1 right crate22)
   goals met: 5 of 25
19. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 4 of 25
20. (drop-crate loc8 person18 crate15 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate15)
   added: (has-content-person person18 food) (empty-arm drone1 left)
   goals met: 5 of 25
21. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 6 of 25
22. (pick-up-crate crate14 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate14 depot)
   added: (has-crate-drone-arm drone1 left crate14)
   goals met: 6 of 25
23. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 5 of 25
24. (drop-crate loc20 person3 crate14 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate14)
   added: (has-content-person person3 food) (empty-arm drone1 left)
   goals met: 6 of 25
25. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 7 of 25
26. (pick-up-crate crate13 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate13 depot)
   added: (has-crate-drone-arm drone1 left crate13)
   goals met: 7 of 25
27. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 6 of 25
28. (drop-crate loc20 person23 crate13 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate13)
   added: (has-content-person person23 food) (empty-arm drone1 left)
   goals met: 7 of 25
29. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 8 of 25
30. (pick-up-crate crate12 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate12 depot)
   added: (has-crate-drone-arm drone1 left crate12)
   goals met: 8 of 25
31. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 7 of 25
32. (drop-crate loc20 person24 crate12 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate12)
   added: (has-content-person person24 food) (empty-arm drone1 left)
   goals met: 8 of 25
33. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 9 of 25
34. (pick-up-crate crate11 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate11 depot)
   added: (has-crate-drone-arm drone1 left crate11)
   goals met: 9 of 25
35. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 8 of 25
36. (drop-crate loc17 person10 crate11 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate11)
   added: (has-content-person person10 food) (empty-arm drone1 left)
   goals met: 9 of 25
37. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 10 of 25
38. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate10 depot)
   added: (has-crate-drone-arm drone1 left crate10)
   goals met: 10 of 25
39. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 9 of 25
40. (drop-crate loc17 person12 crate10 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate10)
   added: (has-content-person person12 food) (empty-arm drone1 left)
   goals met: 10 of 25
41. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 11 of 25
42. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate9 depot)
   added: (has-crate-drone-arm drone1 left crate9)
   goals met: 11 of 25
43. (drone-move depot loc12 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc12)
   goals met: 10 of 25
44. (drop-crate loc12 person1 crate9 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate9)
   added: (has-content-person person1 food) (empty-arm drone1 left)
   goals met: 11 of 25
45. (drone-move loc12 depot drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 depot)
   goals met: 12 of 25
46. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate8 depot)
   added: (has-crate-drone-arm drone1 left crate8)
   goals met: 12 of 25
47. (drone-move depot loc12 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc12)
   goals met: 11 of 25
48. (drop-crate loc12 person21 crate8 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate8)
   added: (has-content-person person21 food) (empty-arm drone1 left)
   goals met: 12 of 25
49. (drone-move loc12 depot drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 depot)
   goals met: 13 of 25
50. (pick-up-crate crate7 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate7 depot)
   added: (has-crate-drone-arm drone1 left crate7)
   goals met: 13 of 25
51. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 12 of 25
52. (drop-crate loc11 person6 crate7 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate7)
   added: (has-content-person person6 food) (empty-arm drone1 left)
   goals met: 13 of 25
53. (drop-crate loc11 person6 crate22 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate22)
   added: (has-content-person person6 medicine) (empty-arm drone1 right)
   goals met: 14 of 25
54. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 15 of 25
55. (pick-up-crate crate21 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate21 depot)
   added: (has-crate-drone-arm drone1 right crate21)
   goals met: 15 of 25
56. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate6 depot)
   added: (has-crate-drone-arm drone1 left crate6)
   goals met: 15 of 25
57. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 14 of 25
58. (drop-crate loc10 person20 crate6 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate6)
   added: (has-content-person person20 food) (empty-arm drone1 left)
   goals met: 15 of 25
59. (drop-crate loc10 person20 crate21 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate21)
   added: (has-content-person person20 medicine) (empty-arm drone1 right)
   goals met: 16 of 25
60. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 17 of 25
61. (pick-up-crate crate20 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate20 depot)
   added: (has-crate-drone-arm drone1 right crate20)
   goals met: 17 of 25
62. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate5 depot)
   added: (has-crate-drone-arm drone1 left crate5)
   goals met: 17 of 25
63. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 16 of 25
64. (drop-crate loc7 person17 crate5 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate5)
   added: (has-content-person person17 food) (empty-arm drone1 left)
   goals met: 17 of 25
65. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 18 of 25
66. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate4 depot)
   added: (has-crate-drone-arm drone1 left crate4)
   goals met: 18 of 25
67. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 17 of 25
68. (drop-crate loc7 person22 crate4 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate4)
   added: (has-content-person person22 food) (empty-arm drone1 left)
   goals met: 18 of 25
69. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 19 of 25
70. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate3 depot)
   added: (has-crate-drone-arm drone1 left crate3)
   goals met: 19 of 25
71. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 18 of 25
72. (drop-crate loc5 person2 crate3 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate3)
   added: (has-content-person person2 food) (empty-arm drone1 left)
   goals met: 19 of 25
73. (drop-crate loc5 person2 crate20 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate20)
   added: (has-content-person person2 medicine) (empty-arm drone1 right)
   goals met: 20 of 25
74. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 21 of 25
75. (pick-up-crate crate19 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate19 depot)
   added: (has-crate-drone-arm drone1 right crate19)
   goals met: 21 of 25
76. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 depot)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 21 of 25
77. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 20 of 25
78. (drop-crate loc4 person14 crate2 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person14 food) (empty-arm drone1 left)
   goals met: 21 of 25
79. (drop-crate loc4 person14 crate19 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate19)
   added: (has-content-person person14 medicine) (empty-arm drone1 right)
   goals met: 22 of 25
80. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 23 of 25
81. (pick-up-crate crate18 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate18 depot)
   added: (has-crate-drone-arm drone1 right crate18)
   goals met: 23 of 25
82. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate1 depot)
   added: (has-crate-drone-arm drone1 left crate1)
   goals met: 23 of 25
83. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 22 of 25
84. (drop-crate loc3 person8 crate1 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate1)
   added: (has-content-person person8 food) (empty-arm drone1 left)
   goals met: 23 of 25
85. (drop-crate loc3 person8 crate18 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate18)
   added: (has-content-person person8 medicine) (empty-arm drone1 right)
   goals met: 24 of 25
86. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 25 of 25
